01Hub/fbedit/STM32F4Discovery/STM32F4_LCMeter/main.c
  /* ADC2 regular channel 11 configuration ************************************/
  ADC_Init(ADC2, &ADC_InitStructure);
  ADC_RegularChannelConfig(ADC2, ADC_Channel_11, 1, ADC_SampleTime_3Cycles);

  /* ADC3 regular channel 11 configuration ************************************/
  ADC_Init(ADC3, &ADC_InitStructure); 
  ADC_RegularChannelConfig(ADC3, ADC_Channel_11, 1, ADC_SampleTime_3Cycles);

  /* Enable ADC1 **************************************************************/
  ADC_Cmd(ADC1, ENABLE);
  /* Enable ADC2 **************************************************************/
  ADC_Cmd(ADC2, ENABLE);
  /* Enable ADC3 **************************************************************/
  ADC_Cmd(ADC3, ENABLE);
  /* Enable DMA request after last transfer (multi-ADC mode) ******************/
  ADC_MultiModeDMARequestAfterLastTransferCmd(ENABLE);
}

/*******************************************************************************
* Function Name  : SPI_Configuration
* Description    : Configures SPI2 to output DDS configuration
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_Config(void)
{
  SPI_InitTypeDef SPI_InitStructure;

	/* Set up SPI2 port */
	SPI_InitStructure.SPI_Direction = SPI_Direction_1Line_Tx;
	SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
	SPI_InitStructure.SPI_DataSize = SPI_DataSize_16b;
	SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
	SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
	SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
	SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_32;
	SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
  SPI_InitStructure.SPI_CRCPolynomial = 7;
	SPI_Init(SPI2, &SPI_InitStructure);
	SPI_Cmd(SPI2, ENABLE);
}

/*******************************************************************************
* Function Name  : USART_Configuration
* Description    : Configures USART3 to to comunicate with Bluetooth module
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void USART_Config(uint32_t Baud)
{
  USART_InitTypeDef USART_InitStructure;
 
  USART_StructInit(&USART_InitStructure);
  //USART_DeInit(USART3);
  USART_InitStructure.USART_BaudRate = Baud;
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No ;
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  USART_Init(USART3, &USART_InitStructure);
  /* Connect USART3 pins */  
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource8, GPIO_AF_USART3);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource9, GPIO_AF_USART3);
  /* Enable the USART3 */
  USART_Cmd(USART3, ENABLE);
}

/**
  * @brief  This function handles TIM3 global interrupt request.
  * @param  None
  * @retval None
  */
void TIM3_IRQHandler(void)
{
  STM32_CMD.ThisCountTIM2 = TIM2->CNT;
  STM32_CMD.ThisCountTIM5 = TIM5->CNT;
  STM32_CMD.STM32_FRQ.Frequency = STM32_CMD.ThisCountTIM2 - STM32_CMD.PreviousCountTIM2;
  STM32_CMD.PreviousCountTIM2 = STM32_CMD.ThisCountTIM2;
  STM32_CMD.STM32_FRQ.FrequencySCP = STM32_CMD.ThisCountTIM5 - STM32_CMD.PreviousCountTIM5;
  STM32_CMD.PreviousCountTIM5 = STM32_CMD.ThisCountTIM5;
  STM32_CMD.TickCount++;
  TIM_ClearITPendingBit(TIM3, TIM_IT_Update);
  STM_EVAL_LEDToggle(LED3);
}

/*****END OF FILE****/
